#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/whip-up/csharp-clean-architecture-github-action/runs/run-6ecPLh451wz5eY2w

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
data.aws_vpc.this: Refreshing...
aws_cloudwatch_log_group.task: Refreshing state... [id=clean-slice-production]
aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:ap-southeast-2:467945566648:cluster/clean-slice-cluster]
data.aws_region.current: Refreshing...
data.aws_caller_identity.current: Refreshing...
aws_ecr_repository.dot-net-architecture: Refreshing state... [id=clean-slice]
aws_iam_role.task: Refreshing state... [id=terraform-20230427135024309700000002]
data.aws_region.current: Refresh complete after 0s [id=ap-southeast-2]
data.aws_caller_identity.current: Refresh complete after 0s [id=467945566648]
aws_iam_role_policy_attachment.task[0]: Refreshing state... [id=terraform-20230427135024309700000002-20230427135025049600000005]
aws_iam_role_policy.task: Refreshing state... [id=terraform-20230427135024309700000002:terraform-20230427135024933600000004]
aws_ecs_task_definition.initiator: Refreshing state... [id=clean-slice-task]
data.aws_vpc.this: Refresh complete after 2s [id=vpc-d23709b5]
data.aws_subnets.this: Refreshing...
aws_security_group.this: Refreshing state... [id=sg-0e1ef5e8e637d4a4f]
aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:targetgroup/clean-slice-lb-tg/a08d81c514673f11]
data.aws_subnets.this: Refresh complete after 0s [id=ap-southeast-2]
aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:loadbalancer/app/clean-slice-alb/0d8a0f9701063a6c]
aws_lb_listener.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:listener/app/clean-slice-alb/0d8a0f9701063a6c/c9d5eeafad5c649b]
aws_lb_listener_rule.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:listener-rule/app/clean-slice-alb/0d8a0f9701063a6c/c9d5eeafad5c649b/5a284721b4302296]
aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:ap-southeast-2:467945566648:service/clean-slice-cluster/clean-slice]
aws_ecs_task_definition.initiator: Drift detected (update)
aws_lb_target_group.this: Drift detected (update)
aws_cloudwatch_log_group.task: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.initiator must be replaced
-/+ resource "aws_ecs_task_definition" "initiator" {
      ~ arn                      = "arn:aws:ecs:ap-southeast-2:467945566648:task-definition/clean-slice-task:2" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0
                  - environment      = []
                  ~ logConfiguration = {
                      ~ options   = {
                          ~ awslogs-group         = "/ecs/clean-slice-production" -> "/ecs/clean-slice"
                            # (2 unchanged attributes hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }
                  - mountPoints      = []
                    name             = "clean-slice"
                  - volumesFrom      = []
                    # (5 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "clean-slice-task" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)
    }

  # aws_lb_target_group.this will be updated in-place
  ~ resource "aws_lb_target_group" "this" {
        id                                 = "arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:targetgroup/clean-slice-lb-tg/a08d81c514673f11"
        name                               = "clean-slice-lb-tg"
        tags                               = {}
        # (15 unchanged attributes hidden)

      ~ health_check {
          ~ path                = "/" -> "/health-probe"
            # (8 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```

</details>

*Pushed by: @jonyeezs*